BenchBnB/app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches" WHERE (lat < '37.80971') AND (lat > '37.74187') AND (lng > '-122.47791') AND (lng < '-122.39208')
---
  def index
    @benches = Bench.all

INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "The first and greatest bench"], ["lat", 37.75398], ["lng", -122.413945], ["created_at", "2018-10-08 17:35:01.685771"], ["updated_at", "2018-10-08 17:35:01.685771"]]
---
  def create
    @bench = Bench.create(bench_params)

    if @bench.save