BenchBnB/app/models/user.rb

  def self.find_by_credentials(username, pw)
    debugger
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "tyler"], ["LIMIT", 1]]

  def reset_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "iCERYpH16tDUXYE8TuObvQ"], ["updated_at", "2018-10-05 18:02:03.736065"], ["id", 1]]